{"pages":[],"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2020/02/29/hello-world/"},{"title":"Writing post on github blog with hexo","text":"Write new post1hexo new post &quot;File Name&quot; Github에 배포하기hexo server를 이용해서 로컬에서 작동을 확인한 후에 Github에 배포한다. Generate &amp; Deploy12hexo generate # hexo ghexo deploy # hexo d More info: hexo-theme-icarus","link":"/2020/02/28/post-20200229/"},{"title":"If commits didn't apply to the contribution graph","text":"github blog를 설정하면서 여러 내용들을 commit 했는데 contribution graph에 전혀 반영이 되지 않고 있다는 것을 알게 되어 여러가지를 찾아보다가 commit을 할 때 사용했던 계정이 나의 계정과 다르다는 것을 알게되었다. git 계정설정12$ git config --global user.name &quot;USER.NAME&quot;$ git config --global user.email &quot;USER.EMAIL&quot; 여기서 나의 github repo의 계정과 동일하게 입력을 해주어야 한다. git config list 확인 / 삭제12$ git config --list # check git config list$ git config --unset --global (variable) # delete variable or user","link":"/2020/03/02/post-20200302/"},{"title":"Contents of ML&DL","text":"Python Pachkages Numpy : Matrix / Linear Algebra / Statistics Scikit-Learn : Maching Learning packages Supervised LearningUn-supervised LearningImage by Gordon Johnson from Pixabay","link":"/2020/03/03/post-20200303/"},{"title":"Python Pachkages-Numpy","text":"Numpy package is python package based on linear algegra and statistics. Advantage of Numpy package is fast calculating speed without loop. However, it is not enough for data processing. Note Use Pandas package to build dataframe and preprocessing.Note jupiter notebook Function array()convert list to ndarray 123456789import numpy as nparray_1 = np.array([[1,2,3],[4,5,6]])print(type(array_1))print(array_1.shape)array_2 = np.array([[1,2,3]])print(type(array_2))print(array_2.shape) output unsplash-logoMax Nelson","link":"/2020/03/04/post-20200304/"},{"title":"Useful Website for Github Blog","text":"imgPressoin-browserimage file size reducing Note: You can set the quality of the image to determine how much to reduce the file size of the image. StackEditin-browser Markdown editor pixabayfree image &amp; royalty free stock Unsplashfreely usable images","link":"/2020/03/03/useful-website/"},{"title":"MIT - Probability Lecture Notes Index","text":"[MIT] Probabilistic Systems Analysis and Applied Probability, Fall 2010 Probability Models and Axioms Conditioning and Bayes’ Rule More Info:","link":"/2020/03/06/post-20200306/"},{"title":"Unity Study - Simple password lock [1]","text":"I implementedd switch to a different screen when a password is entered.It consists of two scripts. The first is to check whether the actual password and the entered password are the same.The second is to inform the user that the wrong password is entered again when the wrong password is entered and return to the password input scene again. PasswordCheck : Compare to the real password 123456789101112131415161718192021222324252627282930313233using UnityEngine;using UnityEngine.UI; //Button... Inputfield...using UnityEngine.SceneManagement;public class PasswordCheck : MonoBehaviour{ private string password = \"greatprogram\"; public InputField UserInput; public string USERINPUT; private string correct = \"Scenes/correct\"; private string wrong = \"Scenes/wrong\"; public void CheckPassword () { USERINPUT = UserInput.text; if (USERINPUT !=null) { if (USERINPUT == password) { SceneManager.LoadScene(correct); } else { SceneManager.LoadScene(wrong); } } } } Return_to_main : Change scenes 123456789101112using UnityEngine;using UnityEngine.UI; //Button... Inputfield...using UnityEngine.SceneManagement;public class ReturnToMain : MonoBehaviour{ private string main = \"Scenes/main\"; public void GoToMain() { SceneManager.LoadScene(main); }}","link":"/2020/03/11/post-20200311/"},{"title":"Cleavage","text":"수정 이후의 여러번의 (frog의 경우 약 37,000번) mitotic이 이루어진다. 빠르게 분열이 이루어지면서 전체 세포질의 크기를 늘리지 않으면서 세포의 개수만 증가하는 현상이 나타난다. embryonic cleavage의 패턴을 결정하는 요소 yolk protein의 양과 분포 egg cytoplasm의 factors(Transcription factors 등) 분열을 하면서 세포질 분리까지 완벽하게 나타나는 경우와 아닌경우에 따라 Holoblast (complete) Cleavage (완전 난할) meroblastic (incomplete) cleavage (불완전난할)로 구분한다.","link":"/2020/03/20/post-20200321/"},{"title":"면역학 STUDY (1) - Immunogen & Antigen","text":"Immunogen : immune response를 일으키는 물질 (넓은 개념)Antigen(Ag) : antibody와 결합하는 물질 Note Immunogen 이면서 Antigen이 아닌 것은? Immunogen은 primary immune system (lymphocyte or plasma cell)을 유도한다. Immunogen이 가지는 두가지 특징은 10kDa 이상의 macromolecule Repetitiveness (반복성) Note 평균적으로 amino acid 한 개의 분자량은 110Da이다. chemical A의 molecular weight(MW)가 100정도의 작은 분자라고 하자. (Hapten) 이런 경우 1개의 분자만으로 immune response를 일으킬 수는 없지만 carrier를 이용하면 (주로 protein with lysine residue) 가능하다. 이때 A는 ligand가 되고 complex는 antigen이 된다. Hapten large carrier에 결합해서 immune response를 일으키는 작은 molecules Question Why carrier protein should contain lysine residue? Epitope (= antigenic deteminant)는 antibody의 active site에 의해 인식되는 부분. Note 그림 첨부","link":"/2020/05/02/post-20200502/"},{"title":"면역학 STUDY (2) - Blood","text":"Plasma : whole blood - cellSerum : whole blood - cell - clotting factors (thrombin, fibrinogen … ) Serum에는 200 종류 이상의 protein이 포함되어있고 (100mg/ml of protein) electrophoresis로 분리 가능하다. 그 중 가장 빠르게 분리 되는 단백질은 pI 4.0 - 4.2의 serum albumin은 acidic polyanion으로 혈액 내 garbage collector의 역할을 한다. (50mg/ml) 또한 가장 느리게 분리되는 단백질은 gamma globulin이다. 모든 antibody가 이 fraction에서 검출된다. (10-12mg/ml) 그림 첨부 예정 : 혈액 내 단백질 구성, pI별, 구성 비율별 전체 100mg/ml 중 serum albumin이 50mg/ml로 50%를 차지하고 gamma globulin 전체 단백질의 10%인 10mg/ml을 차지하는 것이다. 하지만 여기서 Ab activity를 가지지 않는 Normal globulin이 대부분을 차지하고 있고 원하는 specific antibody는 1mg/ml, 즉, 1%를 차지한다. (이 1mlg/ml도 한 종류의 Abs로 이루어져 있지는 않다. 참고 : polycronal) titer란 antibody를 detection 하기 위한 minimum dilution factor로서 antibody가 antigen에 얼마나 잘 반응하는 가를 보여주는 척도이다. 예를 들어 antibody A는 1/1000 dilution (=1000 titer)을 하고 B는 1/10000 dilution (=10000 titer)을 했을 때 최소값으로 antigen을 detection 할 수 있다고 이야기 할 수 있는 것이다. 즉, 다른 조건이 동일 할 때 concentration이 높을 수록, 또는 affinity가 높을 수록 titer의 값은 커진다. 하지만 여기서 concentration의 경우 정비례 하지만, affinity가 커질 경우 log로 증가하는 경향을 보인다. 그러나 carbohydrates가 nucleic acid에 대한 Abs들의 affinity는 거의 증가하지 않는다. antigen 명명법 Mouse anti-BSAmouse : antibody를 생성한 host animalBSA (Bovine Serum Albumin) : immunogen","link":"/2020/05/03/post-20200503/"},{"title":"면역학 STUDY (3) - Antibody","text":"antibody response의 특징 Polyclonal : 다양한 종류의 Abs가 하나의 antigen에 반응한다. 이는 하나의 antigen에 대한 Abs들의 결합 부위가 다르기 때문에 나타난다. 이를 이용해서 antigen에 mutant가 발생해도 다른 종류의 Abs가 이를 대체 할 수 있다. Monoclonal : 하나의 lymphocyte가 한가지 type의 Abs를 만들어낸다. Antibody의 특징 중 하나가 바로 diversity로서 체내에는 $$$10^7$$~$$10^8$$$개의 종류가 존재한다. crossreactivity : antibody가 antigen의 작은 구조적 차이에 tolerance를 가지는 것으로 이는 antigen의 개수보다 antibody의 개수가 적은 것을 설명할 수있다. Question antibody의 개수와 antigen의 대략적 개수는?Note myeloma : clonal expansion이 tumor 처럼 변해서 antibody의 농도가 필요 이상으로 높아지는 (100mg/ml) 것이다. - blood로 이동 Negative control of immune response immunologic tolerance : 발생단계에서 self에 대한 tolerance를 가진다. immune suppression : 장기 이식 등에서 immune response를 억제하는 것. immune paralysis : 과다한 양의 antigen이 들어오게 되면 immune burst를 일으켜서 순간적으로 B cell 이 고갈되는 것을 말한다. Note ATGAM (equine antithymocyte globulin) : 장기이식 거부반응 발생의 위험이 높은 고위험 환자에 사용Note Serum Sickness : 예를 들어 뱀독에 대한 horse serum를 주입했을 때 2번째로 injection 하는 경우에는 memory cell이 발동해서 gamma globulin의 농도가 증가하고 vescosity가 증가해서 문제가 생긴다. Autoimmunity Lupus : Nucleic acids에 대한 Abs 생성 류마티스 관절염 : gamma globulin fraction에 대한 Abs 생성 muscular sclerosis : muscle tissue에 대한 Abs 생성 Haemolytic Anemia : RBC’s에 대한 Abs 생성 autoimmune과 관계가 깊은 것이 complement이다.complement cascade는 antibody-APC complex를 인식하고 apoptosis 시킨다. Polymeric vs. monomeric antibodyantibody 중에서 하나의 binding site를 가지는 univalent한 antibody는 존재하지 않는다. 최소 binding site 개수인 2개를 가진 antibody를 monomeric antibody라고 하고 그 이상을 가진 것을 polymeric이라고 한다. (e.g. IgM은 10개의 binding site를 가지는 polymeric Ab) antibody는 antigen을 어떻게 인식할까? Sequential (primary determinants) : antigen의 primary amino acid sequence를 인식한다. 인식부위는 보통 amino acid 5개 정도로 구성되어 있다. (평균적인 amino acid 기준) Conformational (secondary determinants) : 구조를 인식한다. 이 경우에 antigen의 구조의 변형이 일어나면 인식하지 못한다. 구조적으로 외부에 드러나 있을 가능성이 높아서 hydrophilic 할 가능성이 높다. Note immunoblast를 할 때는 conformational + sequential 이 혼합된 것을 사용한다.Note Da = 1 g/mol","link":"/2020/05/04/post-20200504/"},{"title":"면역학 STUDY (4) - Immune Response","text":"immunogenicityimmunogenicity란 특정 molecule의 immunogenic 한 정도를 이야기하는데, 여기는 molecule의 크기와 redundancy가 중요한 요인으로 작용한다. Note lymphocyte의 surface를 crosslink 하는 ability가 lymphocyte를 activation 시키는 key이기 때문에 redundancy가 더 중요한 요인으로 작용한다. bacteria, viruses, RBCs 들은 size가 크고 antigen determinants들이 많은 수가 반복되어 존재하기 때문에 가장 immunogenic한 물질이다. $$$10^15~10^16$$$ MW보다 큰 soluble한 protein들의 경우에도 동일한 subunit이 반복되어 존재하기 때문에 immunogenic 할 수 있다. protein의 크기가 작더라도 동일한 subunit이 반복 되지 않더라도 온도를 높여서 aggregate된 경우나 chemical crosslinking을 통해 여러개의 determinants를 가지게 하는 경우에는 immunogenic element가 될 수있다. Adjuvantadjuvant는 immune response를 증가시키기 위해 사용하는데 adjuvant는 complete, incomplete가 존재한다. Incomplete adjuvant는 protease를 억제하여 immune response가 활발하게 일어날 수 있도록 돕는다. Complete adjuvant는 lymphocyte activation을 유도한다. Complete Freund’s adjuvant는 incomplete Freund’s adjuvant + Mycobacterium extract로 T cell, B cell을 activation 시키는 역할을 한다. Antibody Response 측정immune response의 정도는 antibody의 concentration을 이용해서 측정한다. antibody의 농도를 측정하는데 여러가지 측정 방법을 소개하고자 한다. BSA를 이용해서 immunization 시켰다고 가정하자. 1. Precipitation assayantigen을 주입한 후에 **7-8일 (lag phase) 이후에 BSA를 serum과 섞으면 만약 antibody가 있으면 BSA와 crosslink를 형성할 것이다. 100ug/ml 이상 Ab가 있어야 검출되고 cross linking 을 형성할 수있을 정도로 high-affinity한 Abs이어야 하기 때문에 insensitive한 assay이다. 초기에는 low-affinity Abs들이 생성되기 때문에 Abs 생성 시작 시점도 정확하게 알 수 없다. 100ug/ml 이상, high affinity of Abs are needed 7~8일 이후에 측정 가능 2. Agglutination Assay열로 SRBC 표면을 fix 시킨다. 이는 cell 표면에 Ag이 고정이 되게 만든다. 이를 test serum과 결합시키면 Abs가 serum에 있으면 crosslink 해서 agglutination이 일어나고 정도를 측정한다. 1mg of Abs are needed 5~7일 이후에 측정 가능 3. Hemeagglutination (Hemolysis)SRBC와 (BSA와 covelently 결합한) test serum을 결합시키고 complement를 넣는다. complement는 Abs와 결합한 SRBC에 반응하여 SRBCs를 lysis 시킨다. lysis로 인해 Hgb이 노출되고 이를 OD400에서 측정한다. 10 ~ 100 nanograms of antibody are needed 4~5일 이후에 측정 가능 4. Phage neutralization assayBSA를 T4 phage의 tail에 결합시킨 후에 E. coli에 infect 시킨다. 배양시킨 plate에 test serum을 넣으면 antibody가 plaque 생성을 방해해서 antibody 농도가 낮을 수록 plague 수가 많다. picogram of antibody are needed 2~3일 이후에 측정 가능 5. Radio Immuno AssayBSA의 tyrosin residue의 I를 I125로 labeling한다.Solution phase의 경우에는 labeling한 BSA를 test serum을 혼합한다. 이후 secondary Ab를 넣어서 precipitation 시켜서 radioisotope를 측정한다. Solid phase의 경우에는 BSA + serum solution을 plate에 coating 시키고 secondary Abs를 처리한다. 여기서 주의할 점은 BSA가 plate에 결합 할 때 한 방향으로 결합을 하기 때문에 특정 determinate의 경우 실제로는 BSA에 결합할 수 있음에도 불구하고 결합을 하지 못한다는 것이다. picogram of antibody are needed 1~2일 이후에 측정 가능 6. Enzyme linked Immuno Assayradio immuno assay에서 radioisotope 대신 B-galactosidase와 같은 enzyme들을 이용한 방법이다. enzyme의 색변화를 이용해서 spectrophotometer로 흡광도를 측정한다. 7. Hemolytic Plaque AssayB cell, T cell을 spleen으로 부터 분리한다. 이를 SRBC-BSA와 섞으면 Abs와 결합할 것이다. 여기에 complement를 넣어주게 되면 SRBC-BSA + Abs는 lysis되어 plaques를 관찰할 수 있다. 100 molecules of antibody are needed 1시간 이내에 측정 가능","link":"/2020/05/06/post-20200506/"},{"title":"면역학 STUDY (5) - Primary Response vs. Secondary Response","text":"Booster EffectPrimary response 이후에 강한 secondary response를 주는 것을 booster effect라고 부른다. booster effect를 최대한 강하게 만들기 위해서는 다시 immunize 시키는 것을 Ab의 농도가 거의 0에 가까울 때 해야하는데 만약 이 시점보다 너무 빨리 immunize하게 되면 주입한 Ag가 primary response에 의해 줄어들어서 두번째 immunization 반응을 크게 유도할 수 없다. 반면 너무 늦게 하게 되면 memory cell의 population이 크게 줄어서 secondary response가 크게 일어나기 힘들다. secondary response는 primary response에 비해 lag phase가 짧게 더 빠르게 짧은 시간 동안 더 강한 affinity를 가진 antibody들의 작용이 일어난다. affinity maturation로 secondary response는 primary에서 IgM을 생성하는 것 과 달리 class switch가 일어나서 affinity가 높은 IgG Abs가 존재한다. 즉 titer가 높은 Abs가 존재한다고 할 수 있다. Note B cell은 Hapten을 인식하고 T cell은 Carrier를 인식한다?","link":"/2020/05/09/post-20200509/"},{"title":"구글 이미지 크롤링","text":"기존에 많이 사용되던 이미지 크롤링 라이브러리 google_image_download 링크가 두 세달 전부터 사용하지 못하게 되어서 다른 방법을 찾고있다. 왜 작동하지 않는지 stackoverflow에서 토론한 내용 아래 예시코드는 google_image_download 예시코드이다. 12345678# $ pip install google_images_downloadfrom google_images_download import google_images_download # importing the libraryresponse = google_images_download.googleimagesdownload() # class instantiationarguments = {&quot;keywords&quot;:&quot;cat&quot;,&quot;limit&quot;:20,&quot;print_urls&quot;:True} # creating list of argumentspaths = response.download(arguments) # passing the arguments to the functionprint(paths) # printing absolute paths of the downloaded images","link":"/2020/06/07/project-data/"},{"title":"딥러닝을 이용한 이미지 컬러링 선행 연구 조사","text":"DeOldify흑백 사진을 컬러로 바꾸는 GAN + VGG16 모델 colab 링크 github 링크 Colab 파일로 만들 때 이미지 주소를 이용해서 test 해볼 수 있어서 매우 간편 Pretrained model에 대한 파일이 존재하기 때문에 실행 시간이 짧음. 123456789source_url = 'https://upload.wikimedia.org/wikipedia/commons/7/78/Coronaviruses_004_lores.jpg' #@param {type:&quot;string&quot;}render_factor = 35 #@param {type: &quot;slider&quot;, min: 7, max: 40}watermarked = True #@param {type:&quot;boolean&quot;}if source_url is not None and source_url !='': image_path = colorizer.plot_transformed_image_from_url(url=source_url, render_factor=render_factor, compare=True, watermarked=watermarked) show_image_in_notebook(image_path)else: print('Provide an image url and try again.') Automatic-Image-ColorizationResNet-18을 이용해서 train 시키고 CNN을 이용해서 upsampling 해서 image colorization한 모델 MIT image data 사용 training에서 test까지 모두 포함되어 있고 40,000개 iamge training training 속도가 비교적 빠름 colab 링크 github 링크 Colorization NetworkCNN만을 이용한 colorizing 모델 colab 링크 github 링크","link":"/2020/06/05/project-research/"},{"title":"발생학 (4) - Bird","text":"Amniotes (양막을 가진 척추 동물) : 조류, 포유류, 파충류 양막을 가진 동물 : 조류, 포유류, 파충류 aminion : desiccation으로 부터 보호, 수분 공급 chorion : blood vessle, gas exchange Allantois : 배설물 보관 Birds ★ 특징은 embryo 납작, 다른것 처럼 보이지만 결과적으로 양서류와 동일하다 ★ 닭은 초파리처럼 난황이 풍부 (meroblastic cleavage) 처음에 cleavage에서 cellulization 나중에 일어난다 ★ PMZ (Posterior Marginal Zone) : 난황 위에서 PMZ가 형성되면서 gastrulation이 시작됩니다. PMZ는 Vg1이라는 유전자를 발현하게 되며 이는 양서류의 수정란에서 vegetal pole과 비슷한 역할을 수행합니다. 또한, gastrulation 과정에서는 양서류의 Nieuwkoop center와 비슷한 기능을 수행합니다. ★ hensen’s node는 양서류에서의 organizer 역할하고 축 형성 가능하다. Blastoderm 형성 과정 이 과정에서 primitive streak extension이 가장 중요하고 conversion extension 이 중요하다. Gasturaltion ★ ingression : 이를 통해 세포가 안쪽으로 들어간다. epithelial 이 하나하나 떨어져서 이동하는 것 ingression이 일어나려면 EMT가 일어나야한다. Note FGF signaling 확인하기, Blastoderm 형성 과정 강의 다시 듣기, SHH signaling 확인하기","link":"/2020/06/16/DB-bird/"},{"title":"발생학 (5) - mammals","text":"Cleavage 양서류처럼 sperm entry point가 dorsal 결정 rotatinoal cleavage Compaction : 8개의 세포가 ECM을 통하여 서로 단단하게 붙게 되는 과정 cavitation : trophoblast가 분비한 체액이 세포 사이에 축적되는 과정 - blastocoele blastocyst : trophectoderm, epiblast, primitive endoderm 구별 되는 마커 : ICM은 Oct4, trophectoderm은 Cdx2 Trophectoderm이랑 ICM이 어떻게 갈라지는지? hatching (착상) : 수정란이 이를 보호하고 있는 zona pellucida를 깨고 나오는 과정 blastocyst into gastrula : egg cylinder ICM, hypoblast trophoblast가 어떻게 연관? 수업 부분 다시 듣기 Axis formation ★ DVE/ AVW 엄마의 배속에서 공간이 나뉘어지기 때문에 mechanical streess에 의해서 AVE가 induction이 - 포유류만 가능함 AVE는 primitive streak의 위치를 결정 ★ Node 마우스의 organizer, neural induction과 AP axis formation에 중요 발생 단계에 따라 Early gastrula organizer (EGO), mid-gastrula organizer (MGO) 그리고 node라고 불린다. (각각의 위치를 기억) organizer는 축 형성 가능 AP는 RA, FGF가 중요. 반대점에 위치하고 서로 반대되는 역할을 하는 시그널이고 limb pometogenesis에서 동일하게 작용. 발생 단계에 따라 embryo turning : 내배엽과 외배엽의 위치가 바뀐다. 척추동물의 gasturaltion 유사점 차이점 차이점: 마우스에는 NK 없다. 공통점 : gastulation에서 가장 먼저 induction 되는 것이 organizer","link":"/2020/06/16/DB-mammals/"},{"title":"발생학 (5) - organogenesis (ectoderm)","text":"ectoderm surface ectoderm neural crest : PNS neural tube : CNS neural tube BMP는 neural에서 surface ectoderm으로 분화를 촉진하는데 organizer에서 나오는 BMP inhibitor들이 이를 억제함. neurulation neural ectoderm에서 neural tube가 만들어지는 과정 primary neuralation Anterior에서 발생 ★ tube formation (folding)에 의하여 neural tube를 형성 secondary neuralation Posterior에서 발생 ★ cavitation에 의하여 neural tube를 형성 BMP가 signal로 작용 + SHH와 상호작용 apical side가 constriction 포유류에서는 neurulation이 동시다발적으로 일어난다 - 개체의 크기가 커서이고 gap을 못메우면 질병 발생 (spina bifida, anencephaly) 양서류나 조류는 A에서 P로 일어난다. ★ 중요한 단백질은 cadherin, N은 N끼리 E는 E끼리 interaction. ★ Notochord에 의해 neural tube의 patterning이 일어난다. Direct contact에 의해서 floor plate, gradient에 의해서 motor neuron (Notochord에 위치 바꾸면 floor plate 두개 만들 수 있음) (SHH의 농도에 따라서 분화) neural crest 가장 versitle한 ★ Neural crest는 neural tube의 dorsal에서 만들어진다. Wnt와 BMP 신호의 지속 기간과 강도에 의하여 조절 ★ Ventral pathway : sclerotome이라는 somite의 한 부분을 통과 ★ Dorsolateral pathway : epidermis와 dermis 사이를 통과 EMT 일어남 ★ Contact Inhibition of Locomotion (CIL) 서로 contact가 일어날 경우 회피하면서 방향을 틀어서 발현하는 Cadherin의 종류가 다르기 때문 neural crest가 일정한 방향으로 이동할 수 있게 해줌. Wnt/PCP pathway chase and run model : placode cell이 signal을 주면 neural crest cell의 migration을 유도하게 되고 migration 해서 만나면 끊고 도망감 Eye Development Reciprocal induction : 발생과정에서 반복되는데 각 layer들이 발생과정을 도와주는 것? Eye field는 한쪽에서 만들어지고 midline이 SHH에 의해 양쪽으로 갈라진다. Paraxial MesodermSometogenesis Oscillation of Notch Signaling : Notch는 mesp라는 transcription factor의 발현을 유도하고, mesp는 Notch의 발현을 억제해서 oscillation한다. * mesp는 cardiac induction의 regulator로 다시 등장 ephrin/Eph signaling에 의하여 somite의 앞과 뒤가 결정되며 somite가 분리 mesp가 발현하는 세포는 Eph를, mesp가 발현하지 않는 세포는 ephrin을 각각 발현하게 됩니다. repulsion에 의하여 앞의 somite와 뒤의 somite가 분리되는 원동력을 제공 clock and wavefront model notch에 대한 반응 정도를 조절하는 것은 Wnt/FGF와 RA의 상대적인 활성 정도 RA는 somite가 새로 형성되는 부분을 경계로 anterior 쪽에, WNT/FGF는 posterior 쪽에 발현하는데 RA가 WNT/FGF를 억제하기 때문에 경계선이 생김. 경계선에 있는 세포는 Notch의 oscillation에 민감하게 반응. 노치가 이와 무관하게 계속 오실레이션 하는데 반응하는부분은 RA와 FGF에 의해 특정 부분에 한정된다. Somite의 수는 oscillation의 빈도에 의하여 조절 intermediate mesoderm Mesoderm에서의 위치 kidney와 somatic gonad 형성 kidney 세 종류의 kidney가 형성됩니다. Pronephros, mesonephros, metanephronic 척추동물 중 양서류는 meso에서 멈추고 어류는 pro에서 멈춤 포유류는 metanephros가 성체에서 발견되는데 이는 성체의 경우 pro, meso는 소실되었기 때문. somatic gonad wolffian duct (male) 와 mullerian duct (female) : kidney에서 glomerulus와 연결되는 ureteric epithelial structure Branching morphogenesis: 관이 어떻게 삼차원 구조 만드는지 신장 폐 등등 Intermediate mesoderm이 어떻게 compartment 나누는지 : 밑에서 Nephrogenic이 신장만들고 nephric tubule이 요관 urogenital이 gonad 만든다. Germ cell은 발생 초기에 segregation 발생이 진행되고 나면 somatic goand 안으로 들어가는데 endoderm이 통로로 작용, endoderm은 cardiac mesoderm의 migration에도 중요하게 작용 Lateral Plate Mesoderm heart, blood vessel 형성 Coelem : lateral plate mesoderm의 위 아래를 나누는 공간. interal organ이 중력에 치우치지 않도록.나중에 cavity가 됨. heart, smooth muscle, endothelial ,blood 의 순으로 형성 heart 심장은 크게 primary와 secondary heart field에서 유래 primary heat field는 주로 scaffold의 역할을 수행, secondary heart field 에서 대부분의 심장 형성 유도하는 가장 중요한 시그널은 BMP, Wnt. Wnt는 낮고 BMP는 높아야 함. BMP와 Wnt는 각각 anterior ectodermal과 neural plate에서 가장 중요한 인자는 mesp1 (somitogenesis에서와 마찬가지) - BMP 타겟으로 작용, cardiac program 활성화, 대척되는 endoderm progenitor같은것들을 방해도 함. Cardiac mesoderm과 endothelial cell은 서로 반대되는 fate 양쪽 끝에서 형성된 cardiac mesoderm은 endoderm을 타고 이동하여 중간에서 합쳐집니다. 혈관에서 나오는 hemogenic endothelium : multipotential progenitor가 fully differentiated cell에서 유래하는 특이한 예 Limb development Limb은 진화적으로 보존된 mechanisms imaginal disc 가장 중요한 부분은 AER이고 Mesenchymal cell의 AP pattering의 중요한 factor들을 발현 Induction : somite에서 분비되는 RA는 TBX5의 발현을 촉진하여 initiation : FGF10의 발현을 촉진해서 limb bud를 initiation outgrouth : FGF10과 FGF8의 positive feeback에 의하여 촉진 FGF는 distal RA는 proximal 한 곳에 걸림 SHH는 limb bud 내에서 ZPA에서만 발현합니다. P/D axis는 RA와 FGF에 의하여 결정됩니다. 이들의 gradient에 따라서 다양한 hox gene들이 발현 somite가 lateral plate meosderm에 영향을 주어 limb이 생긴다. DV axis는 Wnt와 BMP에 의하여 결정 Hox gene의 발현은 앞발에서는 tbx5를 뒷발에서는 tbx4를 각각 발현 SHH의 gradient에 따라 손가락의 종류가 달라집니다 BMP는 이 과정에서 손가락의 기능 Endoderm 내배엽과 중배엽은 서로 영향을 주고받음 - Endoderm의 fate를 결정하는 중요한 인자는 mesoderm에서 공급됩니다. 내배엽 발생에서 가장 중요한 것은 sox17 기억 종에 관련 없이 모든 척추동물에서 endoderm 중요하게 작용 식도가 endoderm의 default fate default를 벗어나기 위해서 Reginal specification에는 BMP, Wnt 중요 master regulator : stomach는 sox2, pancreas는 pdx1, liver는 hex와 prox1 liver ★ FGF signaling은 cardiogenic mesoderm에서 발현되기 때문에 cardiogenic mesoderm이 꼭 필요 pancreas Liver와 대척점 이후 혈관은 pdx1의 발현을 촉진해서 Dorsal aorta는 특히 endocrine pancreas의 형성에 꼭 필요합니다. lung endoderm에서 유래하는 대표적인 기관, 식도에서 갈라지는 organ 진화적으로 부레와 연관 Lung 발생과정에는 Wnt신호가 꼭 필요합니다. Wnt는 두 번 사용되는데, 처음에는 식도와 분리과정에서, 두번째는 lung의 형태형성에 중요합니다. 포유류는 마지막까지 일어나지 않는데 발생과정중에서 호흡 필요 없어서 D/V axis와 P/D axis가 있는데 D/V axis는 Wnt와 BMP에 의하여, P/D axis는 FGF에 의하여 조절됩니다. branching morphogensis","link":"/2020/06/16/DB-organogenesis-ectoderm/"},{"title":"발생학 (3) - Xenopus","text":"Fertilization 체외 수정 Sperm entry point 이후 cortical rotation에 의해서 반대편에 grey crescent, NK center 생기면서 DV 결정 Grey crescent 생기면서 dorsal part에서 베타 카테닌 안정화되서 Wnt signal 나오면서 핵안으로 들어감 Cleavage incomplete cleavage ★ Late blastula (blastoceol이 있고 symmetric) 가 되면 fate map 만들수 있다 Note Wnt signal 정리 Gastualtion symmetric 를깨는, ecto endo meso germ layer 형성 특히 involution, epibody Early gasturaltion AP를 따라서 세포가 나뉘고 bottle cell 형성, 바깥쪽에 ecto가 밀려들어가면서 vegetal pole쪽으로 이동하면서 endodermal cell 이 밀려들어간다. ★ vegetal rotation: bottle cell을 경계로 회전하는 식으로 밀려들어간다. Ectoderm이 vegetal pole 쪽으로 좀더 이동. Bottle cell이 Apical constriction : basal lateral polization 중요하게 역할 Mid gastualation : archenteron 생겨서 blastocel 대체하는게 가장 중요 Late gasturaltion : ecto와 endo 가 만나지 않고 세 layer 결정됨. ★ organizer (그림 2) NK center는 organizer를 induction. organizer에서 Wnt 11이 BMP antagonist - noggin등을 induction하고 organizer가 생김.organizer가 2nd 축 형성 가능. organizer에서는 signaling component들이 전혀 나오지 않는다. 그저 BMP antagonist를 만들 뿐 그 결과 BMP gradient가 ventral 쪽에는 많이 나온다 반면 조류에서는 Sperm entry point가 의미 없고 포유류의 경우 약간 의미가 있다. Neuralation ectoderm에서 neural ectoderm을 만들게 되고 결과적으로 neural tube를 만드는 과정 ★ 여기서 중요한 세포의 이동은 convergent extension 기억 많은 수의 column이 적은 수의 column으로 변하면서 길이가 길어짐 이 과정에서 중요한 것이 planar cell polarity, 이는 apical basal polarity가 먼저 생긴 후에 생김. 표면에서 polarity 이고 Non-canonical Wnt signaling가 중요하다. Strabismus는 세포의 앞에, Frizzled와 Disheveled는 뒤에 위치해서 서로 상호작용함. (강의 다시 들어보기) ★ Ectoderm에서 brain은 BMP, Wnt 둘다 없어야 형성되고 epidermis는 둘다 있어야함. 대척점임 ★ Mesoderm은 vegetal induction에 의해 형성되고 involution과 intercalation이 중배엽을 형성하는데 중요한 두가지 cell movement","link":"/2020/06/15/DB-xenopus/"},{"title":"발생학 (2) -drosophila","text":"Cleavage ★ 난황이 많아서 Cleavage가 일어나고 나면 syncytium을 형성하고 cytokinesis가 나중에 일어난다. Cellularization : Synsytium에서 cellular blastoderm으로 넘어가는 과정 ★ pole cell (germ) 먼저 나가고 (나중에 passive migration으로 몸 중앙으로 이동) syncytium에서 세포가 떨어져 나가는데 MBT에 의해서 embryonic 유전자가 발현이 시작된다. 이 과정에서 polarization이 가장 중요하다. - 위아래 (Apical-Basal)을 구분해야하기 때문 ★ axis specifaction ★ Anterior-Posterior, Dorsal-Ventral, Proximal-Distal, Lateral-Medial (bilateral animal) Gastrualiton ventral side 즉 배쪽, 그리고 양끝에서 일어남. ★ 바깥쪽에 있는 세포가 안쪽으로 들어가면서 Ventral midline에서 이동하는 세포는 중배엽을, 배아의 양쪽 끝에서 이동하는 세포는 내배엽을 만든다. ★ AP axis : terminal follicle cell이 gurken을 분비하면 receptor인 torpedo와 결합해서 PKA acivity를 만들고 microtuble oreintation을 한다. 그러면 Dynein은 bicoid (Anterior 결정) 와 함께 (+)방향으로 이동하고 Kinesin은 oskar (Nanos - posterior 결정) 와 함께 (-)방향으로 이동한다. ★ DV axis : Gurken은 핵이 dorsal로 이동함에 따라서 dorsal로 이동. gurken gradient가 dorsal에서 Vental로 걸리게 되고 결과적으로 pipe - Spatzle - toll로 이어지는 활성을 저해한다. 궁극적으로 dorsal이 많은 쪽이 ventral 적은쪽이 dorsal이 된다. ★ AP DV 관여, AP DV에 어떤 기관들이 위치하는지, 그림 1 참고 Note dosal protein, toll 모두 DV axis에 관여하는데 이 둘의 연관성은? Segmentation maternal gene(bicoid, hunchback, caudal, nanos)의 활성은 다음 단계인 gap gene의 활성을 조절 Gap gene 은 TF pair-rule gene : segment가 인접 segment와 구별 segment polarity gene : 각 segment의 앞과 뒤를 구분하는 유전자, segment의 뒤쪽에서 발현 homeotic gene 최종 mater regulator는 cluster로 존재하고 발현방향 같은 hox gene 순서대로 나열, 모든동물에서 AP axis fomation 결정하고 limb에서는 Proximal distal 결정도함. Segmentation 은 homeotic gene인 hox 에 의해 조절된다. 이는 모든 동물에서 존재하고 구조와 기능도 동일하다.","link":"/2020/06/15/DB-drosophila/"},{"title":"발생학 (1) - Snail & Nematode","text":"동물군은 germ layer의 수에 따라서 diploblastic과 triploblastic으로 나눌 수 있는데 snail(달팽이) 와 nematode(선형동물) triploblastic animals에 속해서 내,중,외배엽을 모두 가진다. Snail Cleavage macromeres, micromeres 형성 spiral cleavage holoblastic cleavage ★ mother’s genotype에 의해 left or right coiling (대표적인 maternal inheritence) ★ 세포 운명이 이미 결정되어 있다. ★ Pitx asymmetry에 가장 중요한 조절 인자로 척추동물에서도 유사한 기능을 수행. (master regulator) Nodal에 의하여 조절되며, 따라서 Pitx가 발현하는 부위는 동물의 왼쪽. (Note(1) 참고) Note(1) Nodal이 왼쪽에서 발현하면서 자신의 inhibitor인 lefty를 발현해서 오른쪽 Nodal signal 억제. 따라서 Nodal이 왼쪽에서 발현하니까 Pitz도 왼쪽에서 발현한다.Note TGF/BMP family signal의 일종인 Nodal Signaling에 대해 따로 정리하기Note D blastomere에 대해 따로 정리하기 C.elegance Germ Cell 어떤 동물이라도 발생과정에서 가장 먼저 갈라지는 lineage는 germ cell, 그 이유는 germ cell이 분열을 하면 할 수록 mutation가능성이 높기 때문에 분리해 놓는다. C elegance에서는 P granules이라는 물질을 가지는 P lineage cell이 가장 먼저 갈라지면서 germ cell이 된다. ★ asymmetric 분열을 하는데 분열한 세포들이 각각 다른 PAR 단백질을 가지고 있다. ★ 세포 운명이 이미 결정되어 있다. - 특정 세포가 발생 초기에 없어지면 전체 linage가 사라짐.","link":"/2020/06/15/DB-triploblastic/"}],"tags":[{"name":"hexo","slug":"hexo","link":"/tags/hexo/"},{"name":"github","slug":"github","link":"/tags/github/"},{"name":"icarus","slug":"icarus","link":"/tags/icarus/"},{"name":"ML","slug":"ML","link":"/tags/ML/"},{"name":"Python","slug":"Python","link":"/tags/Python/"},{"name":"Probability","slug":"Probability","link":"/tags/Probability/"},{"name":"Statistics","slug":"Statistics","link":"/tags/Statistics/"},{"name":"Games","slug":"Games","link":"/tags/Games/"},{"name":"Unity","slug":"Unity","link":"/tags/Unity/"},{"name":"Biology","slug":"Biology","link":"/tags/Biology/"},{"name":"Deep Learning","slug":"Deep-Learning","link":"/tags/Deep-Learning/"},{"name":"Pytorch","slug":"Pytorch","link":"/tags/Pytorch/"}],"categories":[{"name":"github_blog_tutorial","slug":"github-blog-tutorial","link":"/categories/github-blog-tutorial/"},{"name":"Machine Learning & Deep Learning","slug":"Machine-Learning-Deep-Learning","link":"/categories/Machine-Learning-Deep-Learning/"},{"name":"Mathmatics","slug":"Mathmatics","link":"/categories/Mathmatics/"},{"name":"Unity","slug":"Unity","link":"/categories/Unity/"},{"name":"Developmental Biology","slug":"Developmental-Biology","link":"/categories/Developmental-Biology/"},{"name":"Immunology","slug":"Immunology","link":"/categories/Immunology/"},{"name":"ML & DL","slug":"ML-DL","link":"/categories/ML-DL/"}]}